OpenFOAM/foam9tutorials/interfluo/Canonical-Flows/jet/case6/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform .0035735;

boundaryField
{
    inlet1
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0348;
        value           uniform .40856;
    }
	
	inlet2
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       .0488;
        value           $internalField;
    }
    
	outlet
    {
        type            zeroGradient;
    }
	
	wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }


}


// ************************************************************************* //
